Documents/бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачисленияПоСчетчикам</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОбъемыПоУслугамЖКХ</xr:Item>
				<xr:Item>AccumulationRegister.бит_ПоказанияСчетчиков</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>InformationRegister.бит_КолЕдПоОбщедомомвымСчетчикам</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
				<xr:Item>AccumulationRegister.бит_НераспределенныйОстатокПоОбщедомовымСчетчикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецСчетчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоПоказаний</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ИсточникПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЕдиниц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЕдиницПоЛС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислениеПоНормативуОДН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НераспределенныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтПоказаний</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаПоСчетчику</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоСчетчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоСчетчикам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_КолЕдПоОбщедомомвымСчетчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_КолЕдПоОбщедомомвымСчетчикам</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиниц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_ОбъемыПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ОбъемыПоУслугамЖКХ</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НераспределенныйОстатокПоОбщедомовымСчетчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НераспределенныйОстатокПоОбщедомовымСчетчикам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/бит_ИсточникПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ИсточникПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Население</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инспектор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подкрутка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем мОбщедомовыеРасходыВГрафеНачисления          Экспорт; // Хранит флаг настройки ЖКХ.
Перем мУчитыватьНачисленияПоГрупповымСчетчикам     Экспорт; // Хранит флаг настройки ЖКХ.
Перем мУчитыватьПерерасчет                         Экспорт; // Хранит флаг настройки ЖКХ.

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента

Процедура ОбновитьПараметрыЖКХ() Экспорт
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("ОбщедомовыеРасходыВГрафеНачисления"     , Ложь);
	ПараметрыЖКХ.Вставить("УчитыватьНачисленияПоГрупповымСчетчикам", Ложь);
	ПараметрыЖКХ.Вставить("УчитыватьПерерасчет"                    , Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Дата), Организация, ПараметрыЖКХ);
	
	мОбщедомовыеРасходыВГрафеНачисления      = ПараметрыЖКХ.ОбщедомовыеРасходыВГрафеНачисления;
	мУчитыватьНачисленияПоГрупповымСчетчикам = ПараметрыЖКХ.УчитыватьНачисленияПоГрупповымСчетчикам;
	мУчитыватьПерерасчет                     = ПараметрыЖКХ.УчитыватьПерерасчет;
	
КонецПроцедуры

Процедура ВыполнитьРасчет() Экспорт
	
	Начисления.Очистить();
	
	ОбновитьПараметрыЖКХ();
	
	Если НЕ мОбщедомовыеРасходыВГрафеНачисления Тогда
		
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Для организации: " + Организация +" начисления общедомовых расходов ведутся в графе перасчет (разовые).";
			Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли; 
	
	ТаблицаОбщедомовыеНачисления = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуОбщедомовыхРасходов();
	
	бит_РасчетыПоКоммунальнымУслугам.РасчитатьНачисленияПоОбщедомовымРасходам(
	КонецМесяца(Дата),Дата,Дата, Организация, ТаблицаОбщедомовыеНачисления, мУчитыватьНачисленияПоГрупповымСчетчикам, мУчитыватьПерерасчет);
	
	бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаОбщедомовыеНачисления);
	
	ЗаполнениеСчетовКУ(ТаблицаОбщедомовыеНачисления);
	
	ТаблицаОбщедомовыеНачисления.Сортировать("Приоритет ВОЗР, НаименованиеЛС ВОЗР");
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Здание", Здание);
	
	СтрокиПоиска = ТаблицаОбщедомовыеНачисления.НайтиСтроки(Отбор);
	
	Для каждого СтрокаТаблицы Из СтрокиПоиска Цикл
		
		НоваяСтрока = Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура выполняет заполнение Счетов и Субконто.
//
Процедура ЗаполнениеСчетовКУ(ТабНачисления=Неопределено) Экспорт 
	
	Если ТабНачисления=Неопределено тогда
		
		СписокЛС = Начисления.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки  = Начисления.ВыгрузитьКолонки().Колонки;
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(Начисления, Колонки, СписокЛС, Организация , Дата);
		
	Иначе
		
		СписокЛС = ТабНачисления.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки  = ТабНачисления.Колонки;
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ТабНачисления, Колонки, СписокЛС, Организация , Дата);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

Процедура ПервоначальноеЗаполнениеДокумента(ПараметрОбъектКопирования = Неопределено)
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект
		,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"),ПараметрОбъектКопирования);
	
КонецПроцедуры

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, Отказ, Заголовок)
	
	ДатаДока              = Дата;
	НачислениеПоУсл       = Движения.бит_НачисленияПоУслугамЖКХ;
	НачислениеПоСчетчикам = Движения.бит_НачисленияПоСчетчикам;
	КолЕдПоОбщедомовымСЧ  = Движения.бит_КолЕдПоОбщедомомвымСчетчикам;
	ОбъемПоУслугам        = Движения.бит_ОбъемыПоУслугамЖКХ;
	НераспредОстаток      = Движения.бит_НераспределенныйОстатокПоОбщедомовымСчетчикам;

	НачислениеПоУслПоПериоду = Движения.бит_НачисленияПоУслугамЖКХПоПериоду;
	
	ТаблицаРасчетаНДС = Новый ТаблицаЗначений;
	Колонки = ТаблицаРасчетаНДС.Колонки;
	Колонки.Добавить("Номенклатура",	);
	Колонки.Добавить("СуммаНачислений",	ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Колонки.Добавить("СуммаБезНДС",		ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));

	Для каждого СтрокаТЧ Из ТаблицаПоУслугам Цикл
		
		Если СтрокаТЧ.Начислено <> 0 тогда
			
			Если СтрокаТЧ.Начислено > 0 Тогда
				Движение = НачислениеПоУсл.ДобавитьПриход();
				Движение.Сумма       = СтрокаТЧ.Начислено;
			Иначе
				Движение = НачислениеПоУсл.ДобавитьРасход();
				Движение.Сумма       = (СтрокаТЧ.Начислено * -1);
			КонецЕсли;
			
			ДвижениеОбъем = ОбъемПоУслугам.Добавить();
			ДвижениеОбъем.Период      = ДатаДока;
			ДвижениеОбъем.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			ДвижениеОбъем.Услуга      = СтрокаТЧ.Услуга;
			ДвижениеОбъем.Счетчик     = СтрокаТЧ.Счетчик;
			ДвижениеОбъем.Объем       = СтрокаТЧ.КоличествоЕдиницПоЛС;
			
			Движение.Период      = ДатаДока;
			Движение.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			Движение.УслугаЖКХ   = СтрокаТЧ.Услуга;
			
			Движение.Организация   = СтруктураШапкиДокумента.Организация;
			
			Если СтрокаТЧ.Начислено > 0 Тогда
				ДвижениеУслПоПериоду = НачислениеПоУслПоПериоду.ДобавитьПриход();
				ДвижениеУслПоПериоду.Сумма       = СтрокаТЧ.Начислено;
			Иначе
				ДвижениеУслПоПериоду = НачислениеПоУслПоПериоду.ДобавитьРасход();
				ДвижениеУслПоПериоду.Сумма       = (СтрокаТЧ.Начислено * -1);
			КонецЕсли;
			ДвижениеУслПоПериоду.Период				  = ДатаДока;
			ДвижениеУслПоПериоду.ПериодВзаиморасчетов = КонецМесяца(ДатаДока);
			ДвижениеУслПоПериоду.ЛицевойСчет		  = СтрокаТЧ.ЛицевойСчет;
			ДвижениеУслПоПериоду.УслугаЖКХ			  = СтрокаТЧ.Услуга;
			ДвижениеУслПоПериоду.Организация		  = СтруктураШапкиДокумента.Организация;
			
			ДвижениеСЧ = НачислениеПоСчетчикам.Добавить();
			ДвижениеСЧ.Период      = ДатаДока;
			ДвижениеСЧ.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			ДвижениеСЧ.УслугаЖКХ   = СтрокаТЧ.Услуга;
			ДвижениеСЧ.Счетчик     = СтрокаТЧ.Счетчик;
			ДвижениеСЧ.Сумма       = СтрокаТЧ.Начислено;
			
			Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда 
				
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период      = СтруктураШапкиДокумента.Дата;
				Проводка.Содержание  = "Начисление по ЛС";
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				
				Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
				Проводка.СчетКт = СтрокаТЧ.СчетКУ;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);
				Проводка.Сумма = СтрокаТЧ.Начислено;
				
				//10.04.2019
				если Проводка.СчетДт.Количественный = Истина тогда 
				  Проводка.КоличествоДт = СтрокаТЧ.КоличествоЕдиницПоЛС;
				конецесли; 
				
				если Проводка.СчетКт.Количественный = Истина тогда 
				  Проводка.КоличествоКт = СтрокаТЧ.КоличествоЕдиницПоЛС;
				конецесли; 
				
				Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
					Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
						НДС_Ставка = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
						
						Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, СтрокаТЧ.Начислено, НДС_Ставка); 
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ СтрокаТЧ.НераспределенныйОстаток = 0 Тогда
			
			ДвижениеОбъем = НераспредОстаток.Добавить();
			ДвижениеОбъем.Период      = ДатаДока;
			ДвижениеОбъем.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			ДвижениеОбъем.Услуга      = СтрокаТЧ.Услуга;
			ДвижениеОбъем.Счетчик     = СтрокаТЧ.Счетчик;
			ДвижениеОбъем.Сумма       = СтрокаТЧ.НераспределенныйОстаток;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Запрос  = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Услуга,
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Счетчик,
	|	МАКСИМУМ(бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.ОтПоказаний) КАК ОтПоказаний,
	|	МАКСИМУМ(бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.ДоПоказаний) КАК ДоПоказаний,
	|	МАКСИМУМ(бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.КоличествоЕдиниц) КАК КоличествоЕдиниц,
	|	МАКСИМУМ(бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.СтавкаПоСчетчику) КАК СтавкаПоСчетчику,
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.ИсточникПоказаний,
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.ВладелецСчетчика КАК Объект
	|ПОМЕСТИТЬ СписокПоказаний
	|ИЗ
	|	Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Начисления КАК бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления
	|ГДЕ
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Услуга,
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Счетчик,
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.ВладелецСчетчика,
	|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.ИсточникПоказаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокПоказаний.Услуга,
	|	СписокПоказаний.Счетчик,
	|	СписокПоказаний.ОтПоказаний,
	|	СписокПоказаний.ДоПоказаний,
	|	СписокПоказаний.КоличествоЕдиниц,
	|	СписокПоказаний.СтавкаПоСчетчику,
	|	СписокПоказаний.ИсточникПоказаний,
	|	СписокПоказаний.Объект,
	|	бит_ПоказанияСчетчиковОстатки.Объект КАК ОбъектРасход,
	|	бит_ПоказанияСчетчиковОстатки.Услуга КАК УслугаРасход,
	|	бит_ПоказанияСчетчиковОстатки.Счетчик КАК Счетчикрасход,
	|	бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток КАК ПоследниеПоказания,
	|	бит_ПоказанияСчетчиковОстатки.КоэффициентОстаток КАК Коэффициент,
	|	бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияИнспектораОстаток КАК ТекущиеПоказанияИнспектора,
	|	бит_ПоказанияСчетчиковОстатки.ТекущиеПоказанияНаселенияОстаток КАК ТекущиеПоказанияНаселения,
	|	бит_ПоказанияСчетчиковОстатки.ПоказанияПодкруткаОстаток КАК ПоказанияПодкрутка
	|ИЗ
	|	СписокПоказаний КАК СписокПоказаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
	|				&Момент,
	|				Объект В
	|						(ВЫБРАТЬ
	|							СписокПоказаний.Объект
	|						ИЗ
	|							СписокПоказаний)
	|					И Счетчик В
	|						(ВЫБРАТЬ
	|							СписокПоказаний.Счетчик
	|						ИЗ
	|							СписокПоказаний)
	|					И Услуга В
	|						(ВЫБРАТЬ
	|							СписокПоказаний.Услуга
	|						ИЗ
	|							СписокПоказаний)) КАК бит_ПоказанияСчетчиковОстатки
	|		ПО СписокПоказаний.Объект = бит_ПоказанияСчетчиковОстатки.Объект
	|			И СписокПоказаний.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
	|			И СписокПоказаний.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокПоказаний";
	
	Запрос.УстановитьПараметр("Момент",МоментВремени());
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий()  Цикл 
		
		Если  Выборка.УслугаРасход <> Null тогда
			
			Движение = Движения.бит_ПоказанияСчетчиков.ДобавитьРасход();
			Движение.Период                     = Дата;
			Движение.Регистратор                = Ссылка;
			Движение.Объект                     = Выборка.ОбъектРасход;
			Движение.Услуга                     = Выборка.УслугаРасход;
			Движение.Счетчик                    = Выборка.СчетчикРасход;
			Движение.Коэффициент                = Выборка.Коэффициент;
			Движение.ПоследниеПоказания         = Выборка.ПоследниеПоказания;
			Движение.ТекущиеПоказанияИнспектора = Выборка.ТекущиеПоказанияИнспектора;
			Движение.ТекущиеПоказанияНаселения  = Выборка.ТекущиеПоказанияНаселения;
			Движение.ТекущиеПоказанияИнспектора = Выборка.ТекущиеПоказанияИнспектора;
			Движение.ТекущиеПоказанияНаселения  = Выборка.ТекущиеПоказанияНаселения;
			Если Выборка.ИсточникПОказаний = Перечисления.бит_ИсточникПоказаний.Подкрутка Тогда
				Движение.ПоказанияПодкрутка = Выборка.ДоПоказаний;
			КонецЕсли;
			
			Движение.ПоказанияПодкрутка         = Выборка.ПоказанияПодкрутка;
			
			Движение.Организация   = СтруктураШапкиДокумента.Организация;
			
		КонецЕсли;
		
		Движение = Движения.бит_ПоказанияСчетчиков.ДобавитьПриход();
		Движение.Период             = Дата;
		Движение.Регистратор        = Ссылка;
		Движение.Объект             = Выборка.Объект;
		Движение.Услуга             = Выборка.Услуга;
		Движение.Счетчик            = Выборка.Счетчик;
		Движение.Коэффициент        = Выборка.Счетчик.КоэффициентУмножения;
		Движение.ПоследниеПоказания = Выборка.ДоПоказаний;
		
		Если Выборка.ИсточникПоказаний = Перечисления.бит_ИсточникПоказаний.Инспектор Тогда
			Движение.ТекущиеПоказанияИнспектора = Выборка.ДоПоказаний;
		ИначеЕсли  Выборка.ИсточникПоказаний = Перечисления.бит_ИсточникПоказаний.Население Тогда
			Движение.ТекущиеПоказанияНаселения = Выборка.ДоПоказаний;
		ИначеЕсли Выборка.ИсточникПОказаний = Перечисления.бит_ИсточникПоказаний.Подкрутка Тогда
			Движение.ПоказанияПодкрутка = Выборка.ДоПоказаний;
		КонецЕсли;
		
		Движение.Организация   = СтруктураШапкиДокумента.Организация;
		
	КонецЦикла;
	
	ТаблицаПоУслугам.Свернуть("Здание,Услуга,Счетчик,КоличествоЕдиниц");
	
	Для каждого Строка Из ТаблицаПоУслугам Цикл
		
		НоваяЗапись = КолЕдПоОбщедомовымСЧ.Добавить();
		НоваяЗапись.Период           = Дата;
		НоваяЗапись.Здание           = Строка.Здание;
		НоваяЗапись.УслугаЖКХ        = Строка.Услуга;
		НоваяЗапись.Счетчик          = Строка.Счетчик;
		НоваяЗапись.КоличествоЕдиниц = Строка.КоличествоЕдиниц;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ЛицевойСчет"            ,"ЛицевойСчет");
	СтруктураПолей.Вставить("Здание"                 ,"ЛицевойСчет.Здание");
	СтруктураПолей.Вставить("Услуга"                 ,"Услуга");
	СтруктураПолей.Вставить("Счетчик"                ,"Счетчик");
	СтруктураПолей.Вставить("Начислено"              ,"Начислено");
	СтруктураПолей.Вставить("КоличествоЕдиниц"       ,"КоличествоЕдиниц"); 
	СтруктураПолей.Вставить("КоличествоЕдиницПоЛС"   ,"КоличествоЕдиницПоЛС");
	СтруктураПолей.Вставить("НераспределенныйОстаток","НераспределенныйОстаток");
	
	СтруктураПолей.Вставить("СчетАбонента"        ,"СчетАбонента");
	СтруктураПолей.Вставить("Субконто1"           ,"Субконто1");
	СтруктураПолей.Вставить("Субконто2"           ,"Субконто2");
	СтруктураПолей.Вставить("Субконто3"           ,"Субконто3");
	СтруктураПолей.Вставить("СчетКУ"              ,"СчетКУ");
	СтруктураПолей.Вставить("СубконтоКУ1"         ,"СубконтоКУ1");
	СтруктураПолей.Вставить("СубконтоКУ2"         ,"СубконтоКУ2");
	СтруктураПолей.Вставить("СубконтоКУ3"         ,"СубконтоКУ3");
	СтруктураПолей.Вставить("СпособРаспределения" ,"СпособРаспределения");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Начисления", СтруктураПолей);
	ТаблицаПоУслугам          = РезультатЗапросаПоУслугам.Выгрузить();
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ПервоначальноеЗаполнениеДокумента();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТЗСписокЛС = Начисления.Выгрузить(,"ЛицевойСчет");
	
	ТЗСписокЛС.Свернуть("ЛицевойСчет");
	
	СписокЛицевыхСчетов = "";
	
	Для каждого Строка Из ТЗСписокЛС Цикл
		
		Если ПустаяСтрока(Строка.ЛицевойСчет.Наименование) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СписокЛицевыхСчетов = "" Тогда
			СписокЛицевыхСчетов = ""+Строка.ЛицевойСчет.Наименование;
		Иначе
			СписокЛицевыхСчетов = ""+СписокЛицевыхСчетов +", " +Строка.ЛицевойСчет.Наименование;
		КонецЕсли; 
		
	КонецЦикла;
	
	ДокументСтруктура = Новый Структура;
	ДокументСтруктура.Вставить("Имя"            , Метаданные().Имя);
	ДокументСтруктура.Вставить("Ссылка"         , Ссылка);
	ДокументСтруктура.Вставить("ПометкаУдаления", ПометкаУдаления);
	
	бит_РасчетыПоКоммунальнымУслугам.СинхронизацияПометкиНаУдалениеУСДокументамиРаспределенияРасходов(ДокументСтруктура);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
